{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.9.0", "signature": {"inputs": {"movie_input:0": {"name": "movie_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "user_input:0": {"name": "user_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "genre_input": {"name": "genre_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "19"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_1/embedding_2/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "159385"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_2/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_2/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_2/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/flatten_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1000"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1_1/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1_1/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1_1/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/flatten_1_2/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/concatenate_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "147"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1_2/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_2_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_2_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/rating_output_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/rating_output_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "genre_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "19"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "movie_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "user_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1_1/Cast", "op": "Cast", "input": ["movie_input"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_2/Cast", "op": "Cast", "input": ["user_input"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1_1/Less", "op": "Less", "input": ["StatefulPartitionedCall/functional_1/embedding_1_1/Cast", "StatefulPartitionedCall/functional_1/embedding_1_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/embedding_1_1/Cast", "StatefulPartitionedCall/functional_1/embedding_1_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_2/Less", "op": "Less", "input": ["StatefulPartitionedCall/functional_1/embedding_2/Cast", "StatefulPartitionedCall/functional_1/embedding_2/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_2/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/embedding_2/Cast", "StatefulPartitionedCall/functional_1/embedding_2/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/functional_1/embedding_1_1/Less", "StatefulPartitionedCall/functional_1/embedding_1_1/add", "StatefulPartitionedCall/functional_1/embedding_1_1/Cast"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_2/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/functional_1/embedding_2/Less", "StatefulPartitionedCall/functional_1/embedding_2/add", "StatefulPartitionedCall/functional_1/embedding_2/Cast"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/functional_1/embedding_1_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/functional_1/embedding_1_1/SelectV2", "StatefulPartitionedCall/functional_1/embedding_1_1/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_2/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/functional_1/embedding_2/GatherV2/ReadVariableOp", "StatefulPartitionedCall/functional_1/embedding_2/SelectV2", "StatefulPartitionedCall/functional_1/embedding_2/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_1/flatten_1_2/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_1/embedding_1_1/GatherV2", "StatefulPartitionedCall/functional_1/flatten_1_2/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/flatten_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_1/embedding_2/GatherV2", "StatefulPartitionedCall/functional_1/flatten_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/concatenate_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_1/flatten_1/Reshape", "StatefulPartitionedCall/functional_1/flatten_1_2/Reshape", "genre_input", "StatefulPartitionedCall/functional_1/concatenate_1/concat/axis"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_1/concatenate_1/concat", "StatefulPartitionedCall/functional_1/dense_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_1/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "147"}]}, {"dim": [{"size": "147"}, {"size": "128"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1_2/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_1/dense_1/Relu", "StatefulPartitionedCall/functional_1/dense_1_2/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_1/dense_1_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "128"}]}, {"dim": [{"size": "128"}, {"size": "64"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_2_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_1/dense_1_2/Relu", "StatefulPartitionedCall/functional_1/dense_2_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_1/dense_2_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "64"}]}, {"dim": [{"size": "64"}, {"size": "32"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/rating_output_1/Add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_1/dense_2_1/Relu", "StatefulPartitionedCall/functional_1/rating_output_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_1/rating_output_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "32"}]}, {"dim": [{"size": "32"}, {"size": "1"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/functional_1/rating_output_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of10.bin", "group1-shard2of10.bin", "group1-shard3of10.bin", "group1-shard4of10.bin", "group1-shard5of10.bin", "group1-shard6of10.bin", "group1-shard7of10.bin", "group1-shard8of10.bin", "group1-shard9of10.bin", "group1-shard10of10.bin"], "weights": [{"name": "StatefulPartitionedCall/functional_1/embedding_2/GatherV2/ReadVariableOp", "shape": [159385, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/embedding_2/Less/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/embedding_2/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/embedding_2/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/flatten_1/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/embedding_1_1/GatherV2/ReadVariableOp", "shape": [1000, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/embedding_1_1/Less/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/embedding_1_1/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/embedding_1_1/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/flatten_1_2/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/concatenate_1/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/dense_1/Cast/ReadVariableOp", "shape": [147, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/dense_1/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/dense_1_2/Cast/ReadVariableOp", "shape": [128, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/dense_1_2/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/dense_2_1/Cast/ReadVariableOp", "shape": [64, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/dense_2_1/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/rating_output_1/Cast/ReadVariableOp", "shape": [32, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/rating_output_1/Add/ReadVariableOp", "shape": [1], "dtype": "float32"}]}]}